app/controllers/products_controller.rb

  def index
    @products = Product.includes(:category).all
---
SELECT "products".* FROM "products"